nc: 1  # number of classes

# YOLOv8s scaling 
depth_multiple: 0.33
width_multiple: 0.50

backbone:
  # [from, repeats, module, args]
  - [-1, 1, DCNv3, [64, 3, 2]]        # 0-P1/2
  - [-1, 1, DCNv3, [128, 3, 2]]       # 1-P2/4
  - [-1, 3, C2f,   [128, True]]       # 2
  - [-1, 1, DCNv3, [256, 3, 2]]       # 3-P3/8
  - [-1, 6, C2f,   [256, True]]       # 4  (P3)
  - [-1, 1, DCNv3, [512, 3, 2]]       # 5-P4/16
  - [-1, 6, C2f,   [512, True]]       # 6  (P4)
  - [-1, 1, DCNv3, [1024, 3, 2]]      # 7-P5/32
  - [-1, 3, C2f,   [1024, True]]      # 8
  - [-1, 1, SPPF,  [1024, 5]]         # 9

head:
  - [-1, 1, GSConv,      [512, 1, 1]]                 # 10
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]        # 11
  - [[-1, 6], 1, Concat, [1]]                         # 12  concat with P4
  - [-1, 1, VoVGSCSP,    [512]]                       # 13

  - [-1, 1, GSConv,      [256, 1, 1]]                 # 14
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]        # 15
  - [[-1, 4], 1, Concat, [1]]                         # 16  concat with P3
  - [-1, 1, GSConv,      [256, 3, 1]]                 # 17  
  - [-1, 1, VoVGSCSP,    [256]]                       # 18 

  - [-1, 1, GSConv,      [256, 3, 2]]                 # 19
  - [[-1, 13], 1, Concat, [1]]                        # 20  concat with fused P4
  - [-1, 1, VoVGSCSP,    [512]]                       # 21

  - [-1, 1, GSConv,      [512, 3, 2]]                 # 22
  - [[-1, 9], 1, Concat, [1]]                         # 23  concat with SPPF(P5)
  - [-1, 1, VoVGSCSP,    [1024]]                      # 24

  - [[18, 21, 24], 1, Detect, [nc]]                   # 25
